/**
 * Created by Administrator on 2017/11/21.
 */
//jquery代码
$(function () {
    //关闭顶端广告
    $("#close_banner").on("click",function () {
        $("#top_banner").fadeOut(function () {
            $("#top_banner").hide();
        });
    });
    //顶部导航栏部分
    $("#jd-position").on("mouseenter",function (){
        $("#all-position").show();
        $("#cur-position").toggleClass("dt_selected");
    });
    $("#jd-position") .on("mouseleave",function (){
        $("#all-position").hide();
        $("#cur-position").toggleClass("dt_selected");
    });

    $(".fore").on("mouseenter", function () {
        $(this).children(".dd").show();
        $(this).children("dt").toggleClass("fore_dt_sel");
    });
    $(".fore").on("mouseleave", function () {
        $(this).children(".dd").hide();
        $(this).children("dt").toggleClass("fore_dt_sel");
    });

    $("#m-jd").on("mouseenter",function (){
        $("#m-qccode").show();
    }).on("mouseleave",function (){
        $("#m-qccode").hide();
    });
    $("#qc-code").on("mouseenter",function (){
        $("#m-qccode").show();
    }).on("mouseleave",function (){
        $("#m-qccode").hide();
    });

    //搜索框热词与输入
    var searchjson = {
        1:"怡宝矿泉水",
        2:"神舟超品",
        3:"1元兽药",
        4:"潮童保暖季",
        5:"4k电视",
        6:"保湿护手霜",
        7:"防护眼镜",
        8:"山姆回馈",
        9:"无线扩音器"
    };

    //热搜词自动变更函数
    function changesearch(){
        var k =1;
        function fun1() {
            $("#searchtext").val(searchjson[k]);
            k=k+1;
            if(k > 9) {k=1}
        }
        var timer = setInterval(fun1,5000);
        $("#searchtext").on("focus",function(){
            clearInterval(timer);
            if($("#searchtext").css("color") == "rgb(152, 152, 152)") {
                $("#searchtext").val("").css("color", "black");
            }
            else {
                $("#searchtext").val($("#searchtext").val()).css("color", "black");
            }
        }).on("blur", function () {
            if($("#searchtext").val() == ""){
                $("#searchtext").val("图书开抢").css("color","#989898");
                timer = setInterval(fun1,5000);
            }
        });

    }
    changesearch();

    //自动生成导航pop菜单
    var pop_menu = [{
        head:["0","电视","空调","洗衣机","冰箱","厨卫大电","厨房小电","生活电器","个护健康","家庭影音","进口电器"],
        content:[["家电馆","乡镇专卖店","家电服务","家电企业购","商用电器","高端家电"],["曲面电视","超薄电视","HDR电视","OLED电视","4K超清电视","人工智能电视","55英寸","65英寸","电视配件"],["壁挂式空调","柜式空调","中央空调","以旧换新","空调配件"],["滚筒洗衣机","洗烘一体机","波轮洗衣机","迷你洗衣机","烘干机","洗衣机配件"],["多门","对开门","三门","双门","冷柜/冰吧","酒柜","冰箱配件"],["油烟机","燃气灶","烟灶套装","消毒柜","洗碗机","电热水器","燃气热水器","嵌入式厨电","商用厨房电器"],["电饭煲","微波炉","电烤箱","电磁炉","电陶炉","电压力锅","空气炸锅","豆浆机","咖啡机","面包机","榨汁机/原汁机","料理机","电饼铛","养生壶/煎药壶","酸奶机","煮蛋器","面条机","电水壶/热水瓶","电炖锅","多用途锅","电烧烤炉","电热饭盒","其它厨房电器"],["取暖电器","冷风扇","吸尘器/除螨仪","空气净化器","扫地机器人","加湿器","挂烫机/熨斗","电风扇","插座","电话机","饮水机","净水器","除湿机","干衣机","清洁机","收录/音机","毛球修剪器","其它生活电器","生活电器配件"],["剃须刀","口腔护理","电吹风","美容器","洁面仪","卷/直发器","理发器","剃/脱毛器","足浴盆","健康秤/厨房秤","按摩器","足疗机","按摩椅","其它健康电器"],["家庭影院","迷你音响","DVD","功放","回音壁","影音配件"],["进口电器"]]
    },
        {
        head:["1","手机通讯"," 运营商","手机配件"," 摄影摄像","数码配件","影音娱乐","智能设备","电子教育"],
        content:[["玩3C","手机频道","网上营业厅","配件选购中心","企业购","以旧换新"],["手机","对讲机","以旧换新","手机维修"],["合约机","选号码","固话宽带","办套餐","充话费/流量","中国电信","中国移动","中国联通","京东通信","170选号"],["手机壳","贴膜","手机存储卡","数据线","充电器","手机耳机","创意配件","手机饰品","手机电池","苹果周边","移动电源","蓝牙耳机","手机支架","车载配件","拍照配件"],["数码相机","单电/微单相机","单反相机","拍立得","运动相机","摄像机","镜头","户外器材","影棚器材","冲印服务","数码相框"],["存储卡","三脚架/云台","相机包","滤镜","闪光灯/手柄","相机清洁/贴膜","机身附件","镜头附件","读卡器","支架电池/充电器"],["耳机/耳麦","音箱/音响","智能音箱","便携/无线音箱","收音机","麦克风","MP3/MP4","专业音频"],["智能手环","智能手表","智能眼镜","智能机器人","运动跟踪器","健康监测","智能配饰","智能家居","体感车","无人机","其他配件"],["学生平板","点读机/笔","早教益智","录音笔","电纸书","电子词典","复读机"]]
    },
        {
            head:["2","电脑整机","电脑配件","外设产品","游戏设备","网络产品"," 办公设备","文具耗材"," 服务产品"],
            content:[["玩3C","本周热卖","企业采购","GAME+","装机大师","私人定制"],["笔记本","游戏本","平板电脑","平板电脑配件","台式机","一体机","服务器/工作站","笔记本配件"],["显示器","CPU","主板","显卡","硬盘","内存","机箱","电源","散热器","刻录机/光驱","声卡/扩展卡","装机配件","SSD固态硬盘","组装电脑"],["鼠标","键盘","键鼠套装","网络仪表仪器","U盘","移动硬盘","鼠标垫","摄像头","线缆","手写板","硬盘盒","电脑工具","电脑清洁","UPS电源","插座"],["游戏机","游戏耳机","手柄/方向盘","游戏软件","游戏周边"],["路由器","网络机顶盒","交换机","网络存储","网卡","4G/3G上网","网络配件"],["投影机","投影配件","多功能一体机打印机","传真设备","验钞/点钞机","扫描设备","复合机","碎纸机","考勤机","收银机","会议音频视频","保险柜","装订/封装机","安防监控","办公家具","白板"],["硒鼓/墨粉","墨盒","色带","纸类","办公文具","学生文具","文件管理","本册/便签","计算器","笔类","画具","画材","财会用品","刻录碟片/附件"],["延保服务","上门安装","维修保养","电脑软件"]]
        },
        {
            head:["3","厨具","家纺","生活日用","家装软饰","灯具","家具","家装主材","厨房卫浴","五金电工","装修定制"],
            content:[["家装城","居家日用","精品家具","家装建材","国际厨具","装修服务"],["烹饪锅具","锅具套装","保温杯","刀剪菜板","厨房配件","水具酒具","餐具","茶具/咖啡具","保鲜盒"],["床品套件","被子","枕芯","蚊帐","凉席","毛巾浴巾","地毯地垫","床垫/床褥","毯子","抱枕靠垫","窗帘/窗纱","床单/床笠","被套","枕巾枕套","沙发垫套/椅垫","桌布/罩件","电热毯","布艺软饰"],["收纳用品","雨伞雨具","净化除味","浴室用品","洗晒/熨烫","缝纫/针织用品","清洁工具"],["装饰字画","装饰摆件","手工/十字绣","相框/照片墙","墙贴/装饰贴","花瓶","花艺","香薰蜡烛","节庆饰品","钟饰","帘艺隔断","创意家居","保暖防护"],["吸顶灯","吊灯","台灯","筒灯","射灯","装饰灯","LED灯","氛围照明","落地灯","庭院灯","应急灯/手电","节能灯"],["卧室家具","","客厅家具","","餐厅家具","","书房家具","","儿童家具","","储物家具","","阳台/户外","","办公家具","","床","","床垫","","沙发","","电脑椅","","衣柜","","茶几","","电视柜","","餐桌","","电脑桌","","鞋架/衣帽架","","儿童桌椅","","儿童床","","晾衣架"],["瓷砖","","地板","","油漆涂料","","壁纸","","涂刷辅料"],["水槽","","龙头","","淋浴花洒","","马桶","","智能马桶盖","","厨卫挂件","","浴室柜","","浴霸","","垃圾处理器"],["锁具","","电动工具","","手动工具","","测量工具","","劳防用品","","开关插座","","门铃","","监控安防","","配电箱/断路器"],["装修设计","","全包装修","","局部装修","","淋浴房","","橱柜","","集成吊顶","","门","","窗","","壁挂炉","","散热器","","安装服务"]]
        },
        {
            head:["4","女装","男装","内衣","配饰","童装","童鞋"],
            content:[["男装","女装","内衣","童装童鞋","国际品牌","自营服装"],["新品推荐","连衣裙","羽绒服","毛呢大衣","针织衫","棉服","卫衣","短外套","皮草","风衣","羊绒衫","牛仔裤","休闲裤","打底裤","中老年女装","大码女装","打底衫","T恤","衬衫","真皮皮衣","小西装","毛衣","半身裙","加绒裤","雪纺衫","仿皮皮衣","马甲","短裤","正装裤","旗袍/唐装","婚纱","礼服","吊带/背心","时尚套装","当季热卖","设计师/潮牌"],["当季热卖","新品推荐","T恤","牛仔裤","休闲裤","衬衫","短裤","POLO衫","羽绒服","棉服","真皮皮衣","夹克","卫衣","毛呢大衣","大码男装","西服套装","仿皮皮衣","风衣","针织衫","马甲/背心","羊毛衫","羊绒衫","西服","西裤","卫裤/运动裤","工装","设计师/潮牌","唐装/中山装","中老年男装","加绒裤"],["文胸","睡衣/家居服","男士内裤","女士内裤","吊带/背心","文胸套装","情侣睡衣","塑身美体","少女文胸","休闲棉袜","商务男袜","连裤袜/丝袜","美腿袜","打底裤袜","抹胸","内衣配件","大码内衣","打底衫","泳衣","秋衣秋裤","保暖内衣","情趣内衣"],["女士围巾/披肩","男士丝巾/围巾","光学镜架/镜片","太阳镜","防辐射眼镜","老花镜","游泳镜","领带/领结/领带夹","毛线帽","棒球帽","贝雷帽","鸭舌帽","礼帽","遮阳帽","遮阳伞/雨伞","男士腰带/礼盒","女士腰带/礼盒","袖扣","真皮手套","毛线手套","围巾/手套/帽子套装","口罩","耳罩/耳包","毛线/布面料","钥匙扣"],["套装","卫衣","裤子","外套/大衣","毛衣/针织衫","衬衫","户外/运动服","T恤","裙子","亲子装","礼服/演出服","羽绒服","棉服","内衣裤","配饰","家居服","马甲","袜子","民族服装"],["运动鞋","靴子","帆布鞋","皮鞋","棉鞋","凉鞋","拖鞋"]]
        },
        {
            head:["5","面部护肤","洗发护发","身体护理","口腔护理","女性护理","香水彩妆","清洁用品","宠物生活"],
            content:[["清洁用品","美妆馆","个护馆","妆比社","全球购美妆","宠物馆"],["补水保湿","卸妆","洁面","爽肤水","乳液面霜","精华","眼霜","防晒","面膜","剃须","套装"],["洗发","护发","染发","造型","假发","美发工具","套装"],["补水保湿","沐浴","润肤","精油","颈部","手足","纤体塑形","美胸","套装"],["牙膏/牙粉","牙刷/牙线","漱口水","套装"],["卫生巾","卫生护垫","私密护理","脱毛膏"],["BB霜","化妆棉","女士香水","男士香水","底妆","眉笔","睫毛膏","眼线","眼影","唇膏/彩","腮红","美甲","美妆工具","套装"],["纸品湿巾","衣物清洁","清洁工具","家庭清洁","一次性用品","驱虫用品","皮具护理"],["水族世界","狗粮","猫粮","猫狗罐头","狗零食","猫零食","医疗保健","宠物玩具","宠物服饰","猫狗窝","洗护美容","猫砂/猫砂盆","狗厕所/尿垫","宠物牵引","食具水具","小宠用品"]]
        },
        {
            head:["6","时尚女鞋","潮流女包","精品男包","功能箱包","奢侈品","精选大牌","钟表","珠宝首饰","金银投资"],
            content:[["自营鞋靴","自营箱包","时尚鞋包","国际珠宝馆","奢侈品","收藏投资"],["新品推荐","单鞋","休闲鞋","帆布鞋","妈妈鞋","布鞋/绣花鞋","女靴","踝靴","马丁靴","雪地靴","雨鞋/雨靴","高跟鞋","凉鞋","拖鞋/人字拖","鱼嘴鞋","内增高","坡跟鞋","防水台","松糕鞋","鞋配件"],["真皮包","单肩包","手提包","斜挎包","双肩包","钱包","手拿包","卡包/零钱包","钥匙包"],["男士钱包","双肩包","单肩/斜挎包","商务公文包","男士手包","卡包名片夹","钥匙包"],["拉杆箱","拉杆包","旅行包","电脑包","休闲运动包","书包","登山包","腰包/胸包","旅行配件","相机包","妈咪包"],["箱包","钱包","服饰","腰带","鞋靴","太阳镜/眼镜框","饰品","配件"],["GUCCI","COACH","雷朋","施华洛世奇","MK","阿玛尼","菲拉格慕","VERSACE","普拉达","巴宝莉","万宝龙"],["天梭","浪琴","欧米茄","泰格豪雅","DW","卡西欧","西铁城","天王","瑞表","国表","日韩表","欧美表","德表","儿童手表","智能手表","闹钟","挂钟","座钟","钟表配件"],["黄金","K金","时尚饰品","钻石","翡翠玉石","银饰","水晶玛瑙","彩宝","铂金","木手串/把件","珍珠","发饰"],["投资金","投资银","投资收藏","黄金托管"]]
        },
        {
            head:["7","流行男鞋"," 运动鞋包"," 运动服饰"," 健身训练","骑行运动","体育用品","户外鞋服","户外装备","垂钓用品","游泳用品"],
            content:[["体育服务","运动城","户外馆","健身房","骑行馆","钟表城"],["新品推荐","休闲鞋","商务休闲鞋","正装鞋","帆布鞋","凉鞋","拖鞋","功能鞋","增高鞋","工装鞋","雨鞋","传统布鞋","男靴","鞋配件"],["跑步鞋","休闲鞋","篮球鞋","帆布鞋","板鞋","拖鞋","运动包","足球鞋","乒羽网鞋","训练鞋"],["羽绒服","运动套装","运动裤","卫衣/套头衫","夹克/风衣","T恤","运动配饰","棉服","紧身衣","运动背心","乒羽网服"],["跑步机","动感单车","健身车","椭圆机","综合训练器","划船机","甩脂机","倒立机","武术搏击","踏步机","哑铃","仰卧板/收腹机","瑜伽用品","舞蹈用品","运动护具","健腹轮","拉力器/臂力器","跳绳","引体向上器"],["山地车","公路车","折叠车","骑行服","电动车","电动滑板车","城市自行车","平衡车","穿戴装备","自行车配件"],["乒乓球","羽毛球","篮球","足球","轮滑滑板","网球","高尔夫","台球","排球","棋牌麻将","民俗运动","其它"],["户外风衣","徒步鞋","T恤","冲锋衣裤","速干衣裤","越野跑鞋","滑雪服","羽绒服/棉服","休闲衣裤","抓绒衣裤","溯溪鞋","沙滩/凉拖","休闲鞋","软壳衣裤","功能内衣","军迷服饰","登山鞋","工装鞋","户外袜"],["背包","帐篷/垫子","望远镜","烧烤用具","便携桌椅床","户外配饰","军迷用品","野餐用品","睡袋/吊床","救援装备","户外照明","旅行装备","户外工具","户外仪表","登山攀岩","极限户外","冲浪潜水","滑雪装备"],["钓竿","鱼线","浮漂","鱼饵","钓鱼配件","渔具包","钓箱钓椅","鱼线轮","钓鱼灯","辅助装备"],["女士泳衣","比基尼","男士泳衣","泳镜","游泳圈","游泳包防水包","泳帽","游泳配件"]]
        },
        {
            head:["8","房产","汽车车型","汽车价格","汽车品牌","维修保养","汽车装饰","车载电器","美容清洗","安全自驾","汽车服务"],
            content:[["全新汽车","车管家","旗舰店","二手车","直营店","油卡充值"],["最新开盘","普通住宅","别墅","商业办公","海外房产","文旅地产"],["微型车","小型车","紧凑型车","中型车","中大型车","豪华车","MPV","SUV","跑车"],["5万以下","5-8万","8-10万","10-15万","15-25万","25-40万","40万以上"],["宝马","一汽-大众","上汽大众","沃尔沃","五菱宝骏","东风启辰","长安"],["机油","轮胎","添加剂","防冻液","滤清器","蓄电池","雨刷","刹车片/盘","火花塞","车灯","轮毂","维修配件","汽车玻璃","减震器","正时皮带","汽车喇叭","汽修工具","改装配件","原厂件"],["座垫座套","脚垫","头枕腰靠","方向盘套","后备箱垫","车载支架","车钥匙扣","香水","炭包/净化剂","扶手箱","挂件摆件","车用收纳袋/盒","遮阳/雪挡","车衣","车贴","踏板","行李架/箱","雨眉","装饰条","装饰灯","功能小件","车身装饰件"],["行车记录仪","车载充电器","车机导航","车载蓝牙","智能驾驶","对讲电台","倒车雷达","导航仪","安全预警仪","车载净化器","车载吸尘器","汽车音响","车载冰箱","应急电源","逆变器","车载影音","车载生活电器","车载电器配件"],["洗车机","洗车水枪","玻璃水","清洁剂","镀晶镀膜","车蜡","汽车贴膜","底盘装甲","补漆笔","毛巾掸子","洗车配件"],["胎压监测","充气泵","灭火器","车载床","应急救援","防盗设备","自驾野营","摩托车","摩托周边","保温箱","储物箱"],["保养维修","清洗美容","功能升级","改装服务","ETC","驾驶培训","油卡充值","加油卡"]]
        },{
            head:["9","奶粉","营养辅食","尿裤湿巾","喂养用品","洗护用品","寝居服饰","妈妈专区","童车童床","玩具","乐器"],
            content:[["母婴","玩具乐器","品牌街","亲子馆","全球购母婴"],["1段","2段","3段","4段","孕妈奶粉","特殊配方奶粉","有机奶粉"],["米粉/菜粉","面条/粥","果泥/果汁","益生菌/初乳","DHA","钙铁锌/维生素","清火/开胃","宝宝零食"],["NB","S","M","L","XL","XXL","拉拉裤","成人尿裤","婴儿湿巾"],["奶瓶奶嘴","吸奶器","暖奶消毒","辅食料理机","牙胶安抚","食物存储","儿童餐具","水壶/水杯","围兜/防溅衣"],["宝宝护肤","日常护理","洗发沐浴","洗澡用具","洗衣液/皂","理发器","婴儿口腔清洁","座便器","驱蚊防晒"],["睡袋/抱被","家居床品","安全防护","爬行垫","婴儿内衣","婴儿礼盒","婴儿鞋帽袜","婴儿外出服"],["防辐射服","孕妈装","孕妇护肤","妈咪包/背婴带","待产护理","产后塑身","文胸/内裤","防溢乳垫","孕期营养"],["安全座椅","婴儿推车","婴儿床","婴儿床垫","餐椅","学步车","三轮车","自行车","扭扭车","滑板车","电动车"],["适用年龄","遥控/电动","益智玩具","积木拼插","动漫玩具","毛绒布艺","模型玩具","健身玩具","娃娃玩具","绘画/DIY","创意减压"],["钢琴","电钢琴","电子琴","吉他","尤克里里","打击乐器","西洋管弦","民族乐器","乐器配件"]]
        },{
            head:["10","新鲜水果","蔬菜蛋品","精选肉类","海鲜水产","冷饮冻食","中外名酒","进口食品","休闲食品","地方特产","茗茶","饮料冲调","粮油调味"],
            content:[["生鲜","食品饮料","酒类","地方特产","全球购美食"],["苹果","香蕉","梨","橙子","奇异果/猕猴桃","火龙果","榴莲","车厘子","百香果","草莓","国产水果","进口水果"],["蛋品","叶菜类","根茎类","葱姜蒜椒","鲜菌菇","茄果瓜类","半加工蔬菜","半加工豆制品","玉米","山药","地瓜/红薯"],["猪肉","牛肉","羊肉","鸡肉","鸭肉","冷鲜肉","特色肉类","内脏类","冷藏熟食","牛排","牛腩","鸡翅"],["鱼类","虾类","蟹类","贝类","海参","活鲜","特色水产","海产干货","三文鱼","小龙虾","大闸蟹","海产礼盒"],["水饺/馄饨","汤圆/元宵","面点","烘焙半成品","奶酪/黄油","方便速食","火锅丸串","冰淇淋","冷藏果蔬汁","低温乳品"],["白酒","葡萄酒","洋酒","啤酒","黄酒/养生酒","收藏酒/陈年老酒"],["牛奶","饼干蛋糕","糖/巧克力","零食","水","饮料","咖啡粉","冲调品","油","方便食品","米面调味"],["营养零食","休闲零食","坚果炒货","肉干肉脯","熟食腊味","蜜饯果干","糖果/巧克力","饼干蛋糕"],["华北","华东","华南","华中","东北","西北","西南"],["铁观音","普洱","龙井","绿茶","红茶","乌龙茶","花草茶","花果茶","黑茶","白茶","养生茶","其他茶"],["饮料","牛奶酸奶","饮用水","咖啡/奶茶","蜂蜜/柚子茶","冲饮谷物","成人奶粉"],["米面杂粮","食用油","调味品","南北干货","方便食品","烘焙原料","有机食品"]]
        },{
            head:["11","火机烟具","礼品","鲜花速递","绿植园艺","种子","农药","肥料","畜牧养殖","农机农具"],
            content:[["京东礼品","火机烟具","鲜花","京东农服","同城绿植","园林园艺"],["电子烟","烟油","打火机","烟嘴","烟盒","烟斗"],["创意礼品","电子礼品","工艺礼品","美妆礼品","婚庆节庆","礼盒礼券","礼品定制","军刀军具","古董文玩","收藏品","礼品文具","熏香","京东卡"],["鲜花","每周一花","永生花","香皂花","卡通花束","干花"],["绿植盆栽","多肉植物","花卉","苗木","种子种球","花盆花器","园艺土肥","园艺工具","园林机械"],["花草林木类","蔬菜/菌类","瓜果类","大田作物类"],["杀虫剂","杀菌剂","除草剂","植物生长调节剂"],["氮/磷/钾肥","复合肥","有机肥","生物菌肥","水溶/叶面肥"],["预混料","全价料","浓缩料","饲料添加剂","中兽药","西兽药","兽医器具","生产/运输器具"],["微耕机","喷雾器","割草机","农机整机","农机配件","小型农机具","农膜","农技服务"]]
        },{
            head:["12","中西药品","营养健康","营养成分","滋补养生","计生情趣","保健器械","护理护具","隐形眼镜","健康服务"],
            content:[["专科用药","滋补养生","膳食补充","健康监测","两性情话","靓眼视界"],["感冒咳嗽","补肾壮阳","补气养血","止痛镇痛","耳鼻喉用药","眼科用药","口腔用药","皮肤用药","肠胃消化","风湿骨外伤","维生素/钙","男科/泌尿","妇科用药","儿科用药","心脑血管","避孕药","肝胆用药","中风/心绞痛","糖尿病","皮肤/妇科炎症","性功能障碍","肝炎","高血压/血脂","痛风/关节病","前列腺/肾炎"],["调节免疫","调节三高","缓解疲劳","美体塑身","美容养颜","肝肾养护","肠胃养护","明目益智","骨骼健康","改善睡眠"],["维生素/矿物质","蛋白质","鱼油/磷脂","螺旋藻","番茄红素","叶酸","葡萄籽","左旋肉碱","辅酶Q10","益生菌","玛咖","膳食纤维","牛初乳","胶原蛋白","大豆异黄酮","芦荟提取","酵素"],["阿胶","蜂蜜/蜂产品","枸杞","燕窝","冬虫夏草","人参/西洋参","三七","鹿茸","雪蛤","青钱柳","石斛/枫斗","灵芝/孢子粉","当归","养生茶饮","药食同源"],["避孕套","排卵验孕","润滑液","男用延时","飞机杯","倒模","仿真娃娃","震动棒","跳蛋","仿真阳具","情趣内衣"],["血压计","血糖仪","血氧仪","体温计","体重秤","胎心仪","制氧机","呼吸机","雾化器","助听器","轮椅","拐杖","护理床","中医保健","养生器械","理疗仪","家庭护理","智能健康"],["口罩","眼罩/耳塞","跌打损伤","暖贴","鼻喉护理","眼部保健","美体护理"],["透明隐形","彩色隐形","护理液","眼镜配件"],["体检套餐","口腔齿科","基因检测","孕产服务","美容塑型"]]
        },{
            head:["13","邮币","少儿","教育","文艺","经管励志","人文社科","生活","科技","刊/原版","电子书","音像"],
            content:[["图书频道","邮币商城","音像","电子书","图书榜","文娱寄卖商城"],["邮票","钱币","邮资封片","磁卡","票证","礼品册"],["0-2岁","3-6岁","7-10岁","11-14岁","儿童文学","绘本","科普","幼儿启蒙","手工游戏","智力开发","少儿英语","动漫卡通","学前教育","美术书法","少儿国学"],["教材","中小学教辅","考试","外语学习","字典词典","课外读物","英语四六级","会计类考试","国家公务员"],["小说","文学","青春文学","传记","动漫","艺术","摄影","书法","音乐","绘画"],["管理","金融与投资","经济","励志与成功","市场营销","股票","智能经济"],["历史","心理学","政治/军事","国学/古籍","哲学/宗教","社会科学","法律","文化"],["育儿/家教","孕产/胎教","健身保健","旅游/地图","美食","时尚美妆","家居","手工DIY","两性","体育"],["计算机与互联网","科普","建筑","工业技术","电子/通信","医学","科学与自然","农林"],["杂志/期刊","英文原版书","港台图书"],["畅读VIP","小说","励志与成功","经济金融","文学","社科","婚恋两性","外文原版","免费"],["音乐","影视","教育音像","游戏","影视/动漫周边","在线教育"]]
        },
        {
            head:["14","交通出行","酒店预订","旅游度假","商旅服务","演出票务","生活缴费","生活服务","教育培训","彩票","游戏","海外生活"],
            content:[["生活娱乐","电影票","机票","火车票","特惠酒店","企业差旅"],["国内机票","国际机票","火车票","机场服务","机票套餐"],["国内酒店","国际酒店","超值精选酒店"],["国内旅游","出境旅游","全球签证","景点门票","邮轮","旅行保险"],["企业差旅","团队建设","奖励旅游","会议周边","会议展览"],["电影选座","演唱会","音乐会","话剧歌剧","体育赛事","舞蹈芭蕾","戏曲综艺"],["水费","电费","煤气费","城市通","油卡充值","加油卡"],["家政保洁","摄影写真","休闲娱乐","丽人/养生"],["早教幼教","中小学教育","语言培训","学历教育","职业技能","兴趣爱好"],["购彩中心","开奖结果","数据图表","彩民服务"],["QQ充值","游戏点卡","网页游戏","游戏周边","手机游戏","单机游戏"],["留学","留学后服务","游学","外语培训","海外购物"]]
        },
        {
            head:["15","理财","众筹","东家","白条","支付","保险","股票"],
            content:[["金融首页","0元评测","In货推荐"],["京东小金库","基金理财","定期理财"],["智能硬件","流行文化","生活美学","公益","其他权益众筹"],["类固收","私募股权","阳光私募","投资策略"],["京东白条","白条联名卡","京东钢镚","旅游白条","安居白条","校园金融","京东金采"],["京东支付"],["车险","健康险","意外险","旅行险"],["实时资讯","市场行情","投资达人","量化平台"]]
        }]
        //<[^>]*>

    //跳出函数
    function navipopbox (n){
        var navitop = $("<div class=\"navi_box_top\"></div>");
        var navibtm = $("<div class=\"navi_box_btm\"></div>");
        var navipic = $("<div class=\"navi_box_pic\"></div>");

        var headarr = pop_menu[n].head;
        var contentarr = pop_menu[n].content;
        //console.log(headarr);
        for( var i=0; i< contentarr[0].length; i++){
            $(navitop).append("<a href=\"#\">"+contentarr[0][i]+"<i class=\"iconfont r_jt\">&#xe618;</i></a>");
        }
        for (var i=1; i<headarr.length; i++){
            $(navibtm).append("<dl><dt><a href=\"#\">"+headarr[i]+"<i class=\"iconfont r_jt\">&#xe618;</i></a></dt><dd></dd></dl>");
            for (var j=0; j<contentarr[i].length; j++){
                $(navibtm).children().eq(i-1).children("dd").append("<a href=\"#\">"+contentarr[i][j]+"</a>");
            }
        }
        $(navipic).append("<div class=\"navi_brand\"></div>").append("<div class=\"navi_promotion\"></div>");
        if (n == 9){
            for (var i=1; i<4; i++){
                $(navipic).children().eq(0).append("<a href=\"#\"><img src=\"images/datapic/"+n+"/"+i+".jpg\"></a>");
            }
        }else{
            for (var i=1; i<9; i++){
                $(navipic).children().eq(0).append("<a href=\"#\"><img src=\"images/datapic/"+n+"/"+i+".jpg\"></a>");
            }
        }

        for (var i=9; i<11; i++){
            $(navipic).children().eq(1).append("<a href=\"#\"><img src=\"images/datapic/"+n+"/"+i+".jpg\"></a>");
        }
        $("#navi-top").children().eq(headarr[0]).append(navitop).append(navibtm).append(navipic);
    }

    //导航菜单跳出
    $("#navi").on("mouseenter",".zhonglei", function () {
        var a = null;
        a = $(this).attr("index");
        for (var i=0; i<16; i++){
            if(a == i){
                navipopbox(i);
            }
            if(a != i){
                $("#navi-top").children().eq(i).html("");
            }
        }
        $(".navi_pop").show();
    });
    //导航菜单隐藏
    $("#navi").on("mouseleave",function(){
        for (var i=0; i<16; i++){
            $("#navi-top").children().eq(i).html("");
        }
        $(".navi_pop").hide();
    });



    //切换地区
    $("#all-position").on("click","a", function () {
        $(this).addClass("selected").siblings().removeClass("selected").parent().siblings().children("span").html(""+$(this).html()+"");
        //location.reload();
    }).on("mouseenter","a", function () {
        $(this).addClass("waitsele").siblings().removeClass("waitsele");
    });


    //主广告滚动
    function mainAdScroll(){
        var main_ad_timer = null;
        function scrollByTime() {
            var a = $("#ad_pic .show").index();
            function aaa (){
                if(a == 8){
                    a = 0;
                }
                $("#ad_pic").children().eq(a).fadeIn().siblings().fadeOut();
                $("#ad_pic").children().eq(a).addClass("show").siblings().removeClass("show");
                $("#all_circles").children().eq(a).addClass("current").siblings().removeClass("current");
                a+=1;
            }
            console.log(a);
            main_ad_timer = setInterval(aaa,3000);
        }
        scrollByTime();
        $(".slider").on("mouseenter", function () {
            clearInterval(main_ad_timer);
        })
        $(".slider").on("mouseleave", function () {
            scrollByTime();
        });
        $("#arrow_r").on("click", function () {
            var a = $("#ad_pic .show").index();
            $("#ad_pic").children().eq(a).fadeOut().removeClass("show");
            $("#all_circles").children().eq(a).removeClass("current");
            if(a == 7){
                a = -1;
            }
            $("#ad_pic").children().eq(a+1).fadeIn().addClass("show");
            $("#all_circles").children().eq(a+1).addClass("current");
        });

        $("#arrow_l").on("click", function () {
            var a = $("#ad_pic .show").index();
            $("#ad_pic").children().eq(a).fadeOut().removeClass("show");
            $("#all_circles").children().eq(a).removeClass("current");
            if(a == 0){
                a = 8;
            }
            $("#ad_pic").children().eq(a-1).fadeIn().addClass("show");
            $("#all_circles").children().eq(a-1).addClass("current");
        });

        $("#all_circles").on("mouseenter","li", function () {
            $(this).addClass("current").siblings().removeClass("current");
            var a = $(this).index();
            $("#ad_pic").children().eq(a).fadeIn().siblings().fadeOut();
            $("#ad_pic").children().eq(a).addClass("show").siblings().removeClass("show");
        });


    }
    mainAdScroll();

    $("#jd-news-dt").on("mouseenter",".jd_news_head", function () {
        var a = $(this).index();
        $("#jd-news-dd").children().eq(a).addClass("current").siblings().removeClass("current");
        $(".stick").attr("style","transform: translateX("+a*47+"px);");
    });


    //生活服务板块
    $("#lifeservi_icon1").on("mouseenter", function () {
        $("#ls-quick").show();
        $(this).parent().hide(300);
        $("#ls-top").children().eq(0).children("span").addClass("current_tab").parent().siblings().children("span").removeClass("current_tab");
        $("#ls-btm").children().eq(0).show().siblings().hide();

    });
    $("#lifeservi_icon2").on("mouseenter", function () {
        $("#ls-quick").show();
        $(this).parent().hide(300);
        $("#ls-top").children().eq(1).children("span").addClass("current_tab").parent().siblings().children("span").removeClass("current_tab");
        $("#ls-btm").children().eq(1).show().siblings().hide();
    });
    $("#lifeservi_icon3").on("mouseenter", function () {
        $("#ls-quick").show();
        $(this).parent().hide(300);
        $("#ls-top").children().eq(2).children("span").addClass("current_tab").parent().siblings().children("span").removeClass("current_tab");
        $("#ls-btm").children().eq(2).show().siblings().hide();
    });
    $("#lifeservi_icon4").on("mouseenter", function () {
        $("#ls-quick").show();
        $(this).parent().hide(300);
        $("#ls-top").children().eq(3).children("span").addClass("current_tab").parent().siblings().children("span").removeClass("current_tab");
        $("#ls-btm").children().eq(3).show().siblings().hide();
    });


    $("#ls-top").children("a").on("mouseenter", function () {
        var a = $(this).index();
        $(this).children("span").addClass("current_tab").parent().siblings().children("span").removeClass("current_tab");
        $("#ls-btm").children().eq(a).show().siblings().hide();

    });

    //关闭快捷生活服务
    $("#close-quick").on("click", function () {
        $("#ls-quick").hide();
        $("#lifeserviicon").show();
        $("#lifeservi_icon4").off("mouseenter").on("mouseleave", function () {
            $(this).on("mouseenter", function () {
                $("#ls-quick").show();
                $(this).parent().hide(300);
                $("#ls-top").children().eq(3).children("span").addClass("current_tab").parent().siblings().children("span").removeClass("current_tab");
                $("#ls-btm").children().eq(3).show().siblings().hide();
            });
        });
    });


    //快捷生活服务子标签切换
    function SwTab (a,b){
        $(a).on("mouseenter","span",function () {
            var temp = $(this).index();
            $(this).addClass("tab_current").siblings().removeClass("tab_current");
            $(b).children().eq(temp).show().siblings().hide();
        });
    }
    SwTab(".all_jp_tab","#JiPiao");
    SwTab(".all_ht_tab","#Hotel");
    SwTab(".all_gm_tab","#Game");













});